app/controllers/songs_controller.rb

  def index
    if params[:artist_id]
      artist = Artist.find_by(id: params[:artist_id])
      if artist
        @songs = artist.songs
      else
        redirect_to artists_path, alert: "Artist not found"
      end
    end
    @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs"

  def show
    @song = Song.find_by(id: params[:id])
    artist = Artist.find_by(id: params[:artist_id])
    if artist && !artist.songs.include?(@song)
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
SELECT  1 AS one FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT ?  [["artist_id", 3], ["id", 4], ["LIMIT", 1]]